app/Controllers/Mahasiswa.php

    public function index()
    {
        $data['mahasiswa'] = $this->model->findAll();
---
SELECT *
FROM `mahasiswa`

    public function cari()
    {
        $kataKunci = $this->request->getVar('katakunci'); // Ambil input dari form atau AJAX
        if (!$kataKunci) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Kata kunci tidak boleh kosong.']);
        }

        // Gunakan model yang benar
        $model = new ModelMahasiswa();

        // Cari data berdasarkan kolom yang relevan
        $data = $model->like('nim', $kataKunci)
            ->orLike('nama', $kataKunci)
            ->first(); // Ambil hanya satu data
---
SELECT *
FROM `mahasiswa`
WHERE `nim` LIKE '%bariman%' ESCAPE '!'
OR  `nama` LIKE '%bariman%' ESCAPE '!'
 LIMIT 1